УТ_для_edt/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартИнтеграцияАтлант/Module.bsl
/////////////////////////////////////////////////////////////////////////////
// Модуль смартИнтеграцияАтлант предназначен для 
// хранения процедур и функций, связанных с обменом  
// данными со складом Атлант
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура - Процедура выполняет обмен
//  
Процедура ВыполнитьЗаданиеОбменСоСкладомАтлант(Параметры) Экспорт
	
	ЭтоОбменПоРегламентномуЗаданию = Ложь;
	
	Если ТипЗнч(Параметры) = Тип("Строка") Тогда
		
		//Запуск по регламентному задани
		ЭтоОбменПоРегламентномуЗаданию = Истина;
		
		Параметры = Новый Структура("УзелОбмена", ПланыОбмена.смартОбменСоСкладомАтлант.НайтиПоКоду(Параметры));
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Параметры.УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОбмена = ПолучитьНастройкиОбменаУзлаАтлант(Параметры.УзелОбмена);
	
	Если ЭтоОбменПоРегламентномуЗаданию 
		И НЕ НастройкиОбмена.ИспользоватьРегламентныеЗадания Тогда
		
		Возврат;
		
	КонецЕсли;

	//Выгрузка номенклатуры
	ВыполнитьОбменСоСкладомАтлант(НастройкиОбмена, "Справочник.Номенклатура", "Номенклатура");
	
КонецПроцедуры

Функция ВыполнитьОбменСоСкладомАтлант(НастройкиОбмена, ОбъектВыгрузки, Сервис) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(ОбъектВыгрузки) = Тип("Строка") Тогда
		МассивОбъектов = ПолучитьИзмененияПоУзлу(НастройкиОбмена.Ссылка, ОбъектВыгрузки);
	ИначеЕсли ТипЗнч(ОбъектВыгрузки) = Тип("Массив") Тогда	
    	МассивОбъектов = ОбъектВыгрузки;
	КонецЕсли;	
		
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	FTPСоединениеАтлант = ПолучитьFTPСоединение(НастройкиОбмена);
	
	Если FTPСоединениеАтлант = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если Сервис = "Номенклатура" Тогда
		
		ВыгрузитьНаСкладАтлантНоменклатуру(FTPСоединениеАтлант, НастройкиОбмена, МассивОбъектов);
		
	КонецЕсли;	

КонецФункции

//++ #Б-2746 смарт: Лопато 31.03.2025 //Интеграция с WMS. Атлант. Выгрузка номенклатуры  
Процедура ВыгрузитьНаСкладАтлантНоменклатуру(FTPСоединениеАтлант, НастройкиОбмена, МассивОбъектов)
	
	МассивНоменклатуры = ПолучитьНоменклатуруДляВыгрузкиПоОтбору(МассивОбъектов, НастройкиОбмена);
	ДанныеВыгрузки = ПолучитьДанныеВыгрузкиНоменклатуры(МассивНоменклатуры);
	
	ТекущаяДата = ТекущаяДата();
	
	ИмяФайла = "items_" + Формат(ТекущаяДата, "ДФ=dd-MM-yyyy-hh-mm-ss") + ".xml"; 
   	ИмяФайлаЛокальныйПуть = КаталогВременныхФайлов() + ИмяФайла;
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.ОткрытьФайл(ИмяФайлаЛокальныйПуть, Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь)); 
	ЗаписьXML.ЗаписатьОбъявлениеXML(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("instock");
	
	ЗаписатьЭлементXML(ЗаписьXML, "id", "");
	ЗаписатьЭлементXML(ЗаписьXML, "date", Формат(ТекущаяДата, "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписатьЭлементXML(ЗаписьXML, "source_system", "");
	ЗаписатьЭлементXML(ЗаписьXML, "owner", "");
	ЗаписатьЭлементXML(ЗаписьXML, "whse", "");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("catalogs");
	
	ОтразитьВеткуItems(ЗаписьXML, ДанныеВыгрузки);
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //catalogs
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //instock

	ЗаписьXML.Закрыть();
	
	Успешно = ЗаписатьФайлВКаталог(FTPСоединениеАтлант, "MD", ИмяФайлаЛокальныйПуть, ИмяФайла, НастройкиОбмена.ТестовыйКонтур);
	
	Если Успешно Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(НастройкиОбмена.Ссылка, МассивОбъектов);
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-2746 смарт: Лопато 31.03.2025	

#КонецОбласти

#Область ОперацииСФайламиFTP

// Процедура - Процедура выполняет чтение файлов из каталога FTP
//  
Функция ПрочитатьФайлыИзКаталога(FTPСоединениеАтлант, Каталог, Маска = "*", ТестовыйРежим = Ложь) Экспорт

	//in - запросы на приемку, мы размещаем
	//ex_in - ответы по приемкам, мы читаем
	//out - запросы на отгрузку, мы размещаем
	//ex_out - ответы по отгрузкам, мы читаем
	//md - справочник товаров, мы размещаем
	
	//Каталоги для тестирования имеют постфикс "1".
	
	ПутьКаталога = "/" + Каталог + ?(ТестовыйРежим, "1", "");

	Попытка
	
		FTPСоединениеАтлант.УстановитьТекущийКаталог(ПутьКаталога);

		МассивФайлов = FTPСоединениеАтлант.НайтиФайлы("/", Маска);
		
	Исключение

		ЗаписьЖурналаРегистрации("Обмен со складом Атлант", УровеньЖурналаРегистрации.Ошибка, , ,
								 "Не удалось прочитать файлы из каталога " + ПутьКаталога);
		
		МассивФайлов = Новый Массив;
		
	КонецПопытки;
	
	
	Возврат МассивФайлов;
	
КонецФункции

// Процедура - Процедура выполняет запись файла а каталог FTP
//  
Функция ЗаписатьФайлВКаталог(FTPСоединениеАтлант, Каталог, ИмяФайлаЛокальныйПуть, ИмяФайла, ТестовыйРежим = Ложь) Экспорт

	//in - запросы на приемку, мы размещаем
	//ex_in - ответы по приемкам, мы читаем
	//out - запросы на отгрузку, мы размещаем
	//ex_out - ответы по отгрузкам, мы читаем
	//md - справочник товаров, мы размещаем
	
	//Каталоги для тестирования имеют постфикс "1".

	ПутьКаталога = "/" + Каталог + ?(ТестовыйРежим, "1", "");

	Попытка
	
		FTPСоединениеАтлант.УстановитьТекущийКаталог(ПутьКаталога);

		FTPСоединениеАтлант.Записать(ИмяФайлаЛокальныйПуть, ИмяФайла);	

		Результат = Истина;
		
	Исключение

		ЗаписьЖурналаРегистрации("Обмен со складом Атлант", УровеньЖурналаРегистрации.Ошибка, , ,
								 "Не удалось записать файл " + ИмяФайла + " в каталог " + ПутьКаталога);
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьFTPСоединение(НастройкиОбмена) Экспорт

	АдресFTP  = НастройкиОбмена.АтлантFTPАдрес;
	ЛогинFTP  = НастройкиОбмена.АтлантFTPЛогин;
	ПарольFTP = НастройкиОбмена.АтлантFTPПароль;
	
	Если НЕ (ЗначениеЗаполнено(АдресFTP) И ЗначениеЗаполнено(ЛогинFTP) И ЗначениеЗаполнено(ПарольFTP)) Тогда
		Возврат	Неопределено;
	КонецЕсли;	
			 
    Попытка
		FTPСоединение = Новый FTPСоединение(АдресFTP, , ЛогинFTP, ПарольFTP, , Истина, 50);
	Исключение
		Возврат	Неопределено;
	КонецПопытки;
	
	Возврат FTPСоединение;
	
КонецФункции	

Функция ПолучитьНастройкиОбменаУзлаАтлант(УзелОбмена)
	
	НастройкиОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		УзелОбмена, "
		|Ссылка, 
	    |ТестовыйКонтур,
		|ИспользоватьРегламентныеЗадания,
		|АтлантFTPАдрес, 
		|АтлантFTPЛогин, 
		|АтлантFTPПароль, 
		|АтлантFTPНастройкиОтбораНоменклатуры");
	
	Возврат НастройкиОбмена;
	
КонецФункции

Функция ПолучитьИзмененияПоУзлу(Узел, НаименованиеОбъекта)

    Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ
	|" + НаименованиеОбъекта + ".Изменения
	|ГДЕ
	|   Узел = &Узел";

	Запрос.УстановитьПараметр("Узел", Узел);
			
	ВыборкаЗначений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначений.Следующий() Цикл

		Результат.Добавить(ВыборкаЗначений.Ссылка);
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуруДляВыгрузкиПоОтбору(МассивОбъектов, НастройкиОбмена)

	Результат = Ложь;

	// Инициализация настроек
	АтлантFTPСхемаОтбораНоменклатуры = ПланыОбмена.смартОбменСоСкладомАтлант.ПолучитьМакет("АтлантFTPСхемаОтбораНоменклатуры");
	
	АтлантFTPНастройкиОтбораНоменклатуры = НастройкиОбмена.АтлантFTPНастройкиОтбораНоменклатуры.Получить();
	
	Если ТипЗнч(АтлантFTPНастройкиОтбораНоменклатуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкиКомпоновкиОтбораНоменклатуры = АтлантFTPНастройкиОтбораНоменклатуры;
	Иначе
		НастройкиКомпоновкиОтбораНоменклатуры = АтлантFTPСхемаОтбораНоменклатуры.НастройкиПоУмолчанию;
	КонецЕсли;

	ИсточникНастроекОтбораНоменклатуры = Новый ИсточникДоступныхНастроекКомпоновкиДанных(
										       	   ПоместитьВоВременноеХранилище(АтлантFTPСхемаОтбораНоменклатуры, Новый УникальныйИдентификатор()));

	// Инициализация компоновщика
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроекОтбораНоменклатуры);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиОтбораНоменклатуры);

	// Установка параметров СКД
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("МассивСсылок");
	ПараметрКомпановкиДанных.Значение = МассивОбъектов;
	ПараметрКомпановкиДанных.Использование = Истина;	
	
	// Инициализация компоновки СКД
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(АтлантFTPСхемаОтбораНоменклатуры, КомпоновщикНастроек.Настройки, , , 
												  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	// Получаем таблицу значений результата запроса	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаНоменклатуры);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТаблицаНоменклатуры.ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

Функция ПолучитьДанныеВыгрузкиНоменклатуры(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	//++ #3892 смарт: Шляпников 23.07.2025 / Интеграция с WMS. Атлант. Выгрузка номенклатуры. Дополнение. Рефакторинг.
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
	//-- #3892 смарт: Шляпников 23.07.2025
	|	Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УпаковкиЕдиницыИзмерения.Владелец КАК Номенклатура,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка,
	|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	|	УпаковкиЕдиницыИзмерения.Вес КАК Вес,
	|	УпаковкиЕдиницыИзмерения.Высота КАК Высота,
	|	УпаковкиЕдиницыИзмерения.Глубина КАК Глубина,
	|	УпаковкиЕдиницыИзмерения.Ширина КАК Ширина,
	|	УпаковкиЕдиницыИзмерения.Объем КАК Объем,
	|	УпаковкиЕдиницыИзмерения.ОбъемЕдиницаИзмерения КАК ОбъемЕдиницаИзмерения,
	|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	|	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	|	УпаковкиЕдиницыИзмерения.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураРезультата = Новый Структура;
	
	СтруктураРезультата.Вставить("Номенклатура", РезультатЗапроса[0].Выгрузить());
	СтруктураРезультата.Вставить("Упаковки", 	 РезультатЗапроса[1].Выгрузить());
	СтруктураРезультата.Вставить("ШтрихКоды", 	 РезультатЗапроса[2].Выгрузить());

	Возврат СтруктураРезультата;
	
КонецФункции	

Процедура ЗаписатьЭлементXML(ЗаписьXML, Имя, Значение)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	ЗаписьXML.ЗаписатьТекст(Значение);
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	
КонецПроцедуры

Процедура ОтразитьВеткуBarcodes(ЗаписьXML, ДанныеВыгрузки, Номенклатура)

	СтрокиШтрихкодов = 
		ДанныеВыгрузки.Штрихкоды.НайтиСтроки(
			Новый Структура("Номенклатура", Номенклатура));

			
	ЗаписьXML.ЗаписатьНачалоЭлемента("barcodes");
			
	Для Каждого ЭлементШтрихкод Из СтрокиШтрихкодов Цикл

		ЗаписьXML.ЗаписатьНачалоЭлемента("barcode");
		
		ЗаписатьЭлементXML(ЗаписьXML, "name", "EAN13");
		ЗаписатьЭлементXML(ЗаписьXML, "value", ЭлементШтрихкод.Штрихкод);

		ЗаписьXML.ЗаписатьКонецЭлемента(); //barcode
		
	КонецЦикла;	
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); //barcodes
	
КонецПроцедуры

Процедура ОтразитьВеткуUoms(ЗаписьXML, ДанныеВыгрузки, Номенклатура)
	
	СтрокиУпаковки = 
		ДанныеВыгрузки.Упаковки.НайтиСтроки(
			Новый Структура("Номенклатура", Номенклатура));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("uoms");
	
	//Если Не СтрокиУпаковки.Количество() Тогда
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("uom");
	
	НаименованиеУпаковки = "шт";//Номенклатура.ЕдиницаИзмерения.Наименование;
	
	ЗаписатьЭлементXML(ЗаписьXML, "name", 				НаименованиеУпаковки);
	ЗаписатьЭлементXML(ЗаписьXML, "rf_name", 			НаименованиеУпаковки);
	ЗаписатьЭлементXML(ЗаписьXML, "gui_name", 			НаименованиеУпаковки);
	ЗаписатьЭлементXML(ЗаписьXML, "description", 		НаименованиеУпаковки);
	ЗаписатьЭлементXML(ЗаписьXML, "conversion_factor", 	"1");			
	ЗаписатьЭлементXML(ЗаписьXML, "pick_uom", 			"1");						
	ЗаписатьЭлементXML(ЗаписьXML, "default_uom", 		"1");									
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("physical_chars");
	
	ЗначениеВеса = 
		?(Номенклатура.ВесЗнаменатель = 0, 
			Номенклатура.ВесЧислитель,
			Номенклатура.ВесЧислитель / Номенклатура.ВесЗнаменатель);
			
	ЗначениеВеса = СтрЗаменить(Строка(ЗначениеВеса), Символы.НПП, "");
	
	ЗаписатьЭлементXML(ЗаписьXML, "weight", ЗначениеВеса);									
	ЗаписатьЭлементXML(ЗаписьXML, "width", 	"0");									
	ЗаписатьЭлементXML(ЗаписьXML, "height", "0");									
	ЗаписатьЭлементXML(ЗаписьXML, "length", "0");
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //physical_chars
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //uom
		
	//Иначе
	//	
	//	Для Каждого ЭлементУпаковка Из СтрокиУпаковки Цикл
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("uom");
	//		
	//		НаименованиеУпаковки = Номенклатура.ЕдиницаИзмерения.Наименование;
	//		
	//		ЗаписатьЭлементXML(ЗаписьXML, "name", 			НаименованиеУпаковки);
	//		ЗаписатьЭлементXML(ЗаписьXML, "rf_name", 		НаименованиеУпаковки);
	//		ЗаписатьЭлементXML(ЗаписьXML, "gui_name", 		НаименованиеУпаковки);
	//		ЗаписатьЭлементXML(ЗаписьXML, "description", 	НаименованиеУпаковки);
	//		
	//		Коэффициент =
	//		?(ЭлементУпаковка.Знаменатель = 0, 
	//			ЭлементУпаковка.Числитель,
	//			ЭлементУпаковка.Числитель / ЭлементУпаковка.Знаменатель);
	//		
	//		Коэффициент	= Строка(Коэффициент);
	//		
	//		ЗаписатьЭлементXML(ЗаписьXML, "conversion_factor", 	Коэффициент);			
	//		ЗаписатьЭлементXML(ЗаписьXML, "pick_uom", 			Коэффициент);						
	//		ЗаписатьЭлементXML(ЗаписьXML, "default_uom", 		Коэффициент);					
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("physical_chars");
	//		
	//		ЗаписатьЭлементXML(ЗаписьXML, "weight", СокрЛП(ЭлементУпаковка.Вес));
	//		ЗаписатьЭлементXML(ЗаписьXML, "height", СокрЛП(ЭлементУпаковка.Высота));
	//		ЗаписатьЭлементXML(ЗаписьXML, "width", 	СокрЛП(ЭлементУпаковка.Ширина));												
	//		ЗаписатьЭлементXML(ЗаписьXML, "length", СокрЛП(ЭлементУпаковка.Глубина));						
	//		
	//		ЗаписьXML.ЗаписатьКонецЭлемента(); //physical_chars
	//		
	//		ЗаписьXML.ЗаписатьКонецЭлемента(); //uom
	//		
	//	КонецЦикла;	
	//	
	//КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //uoms

КонецПроцедуры

Процедура ОтразитьВеткуItems(ЗаписьXML, ДанныеВыгрузки)

	ЗаписьXML.ЗаписатьНачалоЭлемента("items");
	
	//item
	Для Каждого ЭлементНоменклатуры Из ДанныеВыгрузки.Номенклатура Цикл

		ЗаписьXML.ЗаписатьНачалоЭлемента("item");
		
		//++ #3892 смарт: Шляпников 23.07.2025 / Интеграция с WMS. Атлант. Выгрузка номенклатуры. Дополнение. Рефакторинг.
		ЗаписатьЭлементXML(ЗаписьXML, "sku", 					ЭлементНоменклатуры.Код);
		ЗаписатьЭлементXML(ЗаписьXML, "lot_track_exp_date", 	?(ЭлементНоменклатуры.ИспользоватьСерии, "1", "0"));
		ЗаписатьЭлементXML(ЗаписьXML, "lot_track", 				?(ЭлементНоменклатуры.ИспользоватьСерии, "1", "0"));
		//-- #3892 смарт: Шляпников 23.07.2025
		ЗаписатьЭлементXML(ЗаписьXML, "description", 			ЭлементНоменклатуры.Наименование);
		ЗаписатьЭлементXML(ЗаписьXML, "rf_screen_description", 	ЭлементНоменклатуры.Наименование);
		ЗаписатьЭлементXML(ЗаписьXML, "active", 				"1");
		ЗаписатьЭлементXML(ЗаписьXML, "price", 					"");		
		ЗаписатьЭлементXML(ЗаписьXML, "serial_control", 		"NONE");		
		
		ОтразитьВеткуBarcodes(ЗаписьXML, ДанныеВыгрузки, ЭлементНоменклатуры.Номенклатура);
		ОтразитьВеткуUoms(ЗаписьXML, ДанныеВыгрузки, ЭлементНоменклатуры.Номенклатура);				
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //item
		
	КонецЦикла;		
	
	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция НомерНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт
	
	// {Обработчик: ПриПолученииНомераНаПечать} Начало
	СтандартнаяОбработка = Истина;
	
	ПрефиксацияОбъектовКлиентСерверПереопределяемый.ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка,
		УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат НомерОбъекта;
	КонецЕсли;
	// {Обработчик: ПриПолученииНомераНаПечать} Окончание
	
	НомерОбъекта = СокрЛП(НомерОбъекта);
	
	// Удаляем пользовательские префиксы из номера объекта.
	Если УдалитьПользовательскийПрефикс Тогда
		
		НомерОбъекта = ПрефиксацияОбъектовКлиентСервер.УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
		
	КонецЕсли;
	
	// Удаляем префикс организации и префикс информационной базы из номера объекта.
	НомерОбъекта = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Истина, УдалитьПрефиксИнформационнойБазы);
	
	Возврат НомерОбъекта;
КонецФункции

Функция ПолучитьСтруктуруПараметровШапкиАтлант() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИД", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Менеджер", "");
	Результат.Вставить("ДатаОтгрузки", "");
	Результат.Вставить("Автомобиль", "");
	Результат.Вставить("Водитель", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяФайлаПоДокументу(Документ, Направление, Расширение) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") И Направление = 1 Тогда
		ИмяФайла = СтрШаблон("SO_Отгрузка КОМ-%1 от %2.%3", НомерНаПечать(Документ.Номер, Истина, Истина), Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"), Расширение);
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") И Направление = 2 Тогда
		ИмяФайла = СтрШаблон("PO_Приемка КОМ-%1 от %2.%3", НомерНаПечать(Документ.Номер, Истина, Истина), Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"), Расширение);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПолучитьПапкуВыгрузкиДляДокумента(Документ, Направление) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") И Направление = 1 Тогда
		Папка = СтрШаблон("%1\Заявки на отгрузку по сборкам (разборкам)", СокрЛП(Документ.Склад.смартКаталогСклада));
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") И Направление = 2 Тогда
		Папка = СтрШаблон("%1\Заявки на приемку по сборкам (разборкам)", СокрЛП(Документ.Склад.смартКаталогСклада));
	КонецЕсли;
	
	Возврат Папка;
	
КонецФункции

Функция СформироватьXMLФайлПриемки(ДанныеШапки, Товары, УникальныйИдентификатор) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь)); 
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
    ЗаписьXML.ЗаписатьНачалоЭлемента("instock");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(ДанныеШапки.ИД));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("source_system");
	ЗаписьXML.ЗаписатьТекст("1c_ut");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("owner");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("whse");
	ЗаписьXML.ЗаписатьТекст("01");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("documents");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("document");
	ЗаписьXML.ЗаписатьАтрибут("type", "PO");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("header");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("doc_number");
	ЗаписьXML.ЗаписатьТекст(ДанныеШапки.Номер);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("status");
	ЗаписьXML.ЗаписатьТекст("NEW");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("type");
	ЗаписьXML.ЗаписатьТекст("DEFAULT");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("created_date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("expected_date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("senderId");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //header
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("lines");
	
	Счетчик = 0;
	
	Для каждого стрТовары Из Товары Цикл
		
		Счетчик = Счетчик + 1;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("line");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("doc_number");
		ЗаписьXML.ЗаписатьТекст(ДанныеШапки.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sku");
		ЗаписьXML.ЗаписатьТекст(стрТовары.Номенклатура.Код);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("line_no");
		ЗаписьXML.ЗаписатьТекст(Формат(Счетчик, "ЧЦ=5; ЧВН=; ЧГ="));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ordered_quantity");
		ЗаписьXML.ЗаписатьТекст(Формат(стрТовары.Количество, "ЧДЦ=3; ЧРД=."));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(стрТовары.Серия) И ЗначениеЗаполнено(стрТовары.Серия.Номер) Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("lot_string");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(стрТовары.Серия.Номер));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		ИначеЕсли ЗначениеЗаполнено(стрТовары.Серия) Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("lot_string");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(стрТовары.Серия));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //line
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //lines
	ЗаписьXML.ЗаписатьКонецЭлемента(); //document
	ЗаписьXML.ЗаписатьКонецЭлемента(); //documents
	ЗаписьXML.ЗаписатьКонецЭлемента(); //instock
	
   	ЗаписьXML.Закрыть();
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Адрес;
	
КонецФункции

Функция СформироватьXMLФайлОтгрузки(ДанныеШапки, Товары, УникальныйИдентификатор) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь)); 
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
    ЗаписьXML.ЗаписатьНачалоЭлемента("instock");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(ДанныеШапки.ИД);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("source_system");
	ЗаписьXML.ЗаписатьТекст("1c_ut");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("owner");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("whse");
	ЗаписьXML.ЗаписатьТекст("01");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("documents");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("document");
	ЗаписьXML.ЗаписатьАтрибут("type", "SO");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("header");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("doc_number");
	ЗаписьXML.ЗаписатьТекст(ДанныеШапки.Номер);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("status");
	ЗаписьXML.ЗаписатьТекст("NEW");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("type");
	ЗаписьXML.ЗаписатьТекст("DEFAULT");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("created_date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("expected_date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("receiverId");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ship_address");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //header
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("lines");
	
	Счетчик = 0;
	
	Для каждого стрТовары Из Товары Цикл
		
		Счетчик = Счетчик + 1;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("line");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sku");
		ЗаписьXML.ЗаписатьТекст(стрТовары.Номенклатура.Код);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("line_no");
		ЗаписьXML.ЗаписатьТекст(Формат(Счетчик, "ЧЦ=5; ЧВН=; ЧГ="));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("lot_string");
			Если ЗначениеЗаполнено(стрТовары.Серия.Номер) Тогда
				ЗаписьXML.ЗаписатьТекст(СокрЛП(стрТовары.Серия.Номер));
			Иначе
				ЗаписьXML.ЗаписатьТекст(СокрЛП(стрТовары.Серия));
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ordered_quantity");
		ЗаписьXML.ЗаписатьТекст(Формат(стрТовары.Количество, "ЧДЦ=3; ЧРД=."));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //line
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //lines
	ЗаписьXML.ЗаписатьКонецЭлемента(); //document
	ЗаписьXML.ЗаписатьКонецЭлемента(); //documents
	ЗаписьXML.ЗаписатьКонецЭлемента(); //instock
	
   	ЗаписьXML.Закрыть();
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Адрес;
	
КонецФункции

Функция СформироватьУведомлениеОбОтгрузкеАтлант(ДанныеШапки, Товары, УникальныйИдентификатор) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.АвтоМасштаб = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаОтгрузкуАтлант");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Номер = ДанныеШапки.Номер;
	Область.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	Область.Параметры.Менеджер = СокрЛП(ДанныеШапки.Менеджер);
	Область.Параметры.Получатель = СтрШаблон("ООО ""Смарт-Т"" / %1", СокрЛП(ДанныеШапки.Менеджер));
	Область.Параметры.ДатаДоставки = ДанныеШапки.ДатаОтгрузки;
	Область.Параметры.Автомобиль = ДанныеШапки.Автомобиль;
	Область.Параметры.Водитель = ДанныеШапки.Водитель;
	Область.Параметры.КоличествоСтрок = Товары.Количество();
	Таб.Вывести(Область);
	
	Для каждого стрТовары Из Товары Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Код = стрТовары.Номенклатура.Код;
		Область.Параметры.НоменклатураНаименованиеПолное = стрТовары.Номенклатура.НаименованиеПолное;
		Область.Параметры.Количество = стрТовары.Количество;
		
		Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
			Если ЗначениеЗаполнено(стрТовары.Серия.Номер) Тогда
				Область.Параметры.Серия = стрТовары.Серия.Номер;
			Иначе
				Область.Параметры.Серия = стрТовары.Серия;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрТовары.Характеристика) Тогда
			Область.Параметры.НоменклатураНаименованиеПолное = СтрШаблон("%1 (%2)", стрТовары.Номенклатура.НаименованиеПолное, стрТовары.Характеристика);
		КонецЕсли;
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
 	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
	Таб.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLS);
	Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Адрес = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Адрес;
	
КонецФункции

Функция СформироватьУведомлениеОПриемкеАтлант(ДанныеШапки, Товары, УникальныйИдентификатор) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.АвтоМасштаб = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаПриемкуАтлант");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Номер = ДанныеШапки.Номер;
	Область.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	Область.Параметры.Менеджер = СокрЛП(ДанныеШапки.Менеджер);
	Область.Параметры.Получатель = СтрШаблон("ООО ""Смарт-Т"" / %1", СокрЛП(ДанныеШапки.Менеджер));
	Область.Параметры.ДатаДоставки = ДанныеШапки.ДатаОтгрузки;
	Область.Параметры.Автомобиль = ДанныеШапки.Автомобиль;
	Область.Параметры.Водитель = ДанныеШапки.Водитель;
	Область.Параметры.КоличествоСтрок = Товары.Количество();
	Таб.Вывести(Область);
	
	Для каждого стрТовары Из Товары Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(стрТовары);
		Область.Параметры.Код = стрТовары.Номенклатура.Код;
		Область.Параметры.НоменклатураНаименованиеПолное = стрТовары.Номенклатура.НаименованиеПолное;
		
		Если ЗначениеЗаполнено(стрТовары.Серия) И ЗначениеЗаполнено(стрТовары.Серия.Номер) Тогда
			Область.Параметры.Серия = СокрЛП(стрТовары.Серия.Номер);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрТовары.Характеристика) Тогда
			Область.Параметры.НоменклатураНаименованиеПолное = СтрШаблон("%1 (%2)", стрТовары.Номенклатура.НаименованиеПолное, стрТовары.Характеристика);
		КонецЕсли;
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
	Таб.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLS);
	Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Адрес = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Адрес;
	
КонецФункции

Процедура ВыгрузитьМассивНоменклатурыНаFTP(МассивНоменклатуры, ЗНАЧ Узел = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивУзлов = ПолучитьМассивУзловАтлант();
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, МассивНоменклатуры);
	
	Если НЕ Узел = Неопределено Тогда
		смартИнтеграцияАтлант.ВыполнитьЗаданиеОбменСоСкладомАтлант(Новый Структура("УзелОбмена", Узел));
	Иначе
		
		Для каждого Узел Из МассивУзлов Цикл
			смартИнтеграцияАтлант.ВыполнитьЗаданиеОбменСоСкладомАтлант(Новый Структура("УзелОбмена", Узел));
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ЭтоСкладАтлант(Склад) Экспорт
	
	Возврат ЗначениеЗаполнено(Склад.смартНастройкаОбменомСАтлант);
	
КонецФункции

#КонецОбласти

#Область Обмен

// Процедура - Процедура регистрирует изменения при записи справочников и документов
//  
Процедура ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаАтлант(Источник, Отказ) Экспорт
	
	Если НЕ Отказ Тогда
		
		ЗарегистрироватьИзмененияАтлант(Источник);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияАтлант(Объект, Замещение = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);

	МассивУзловАтлант = ПолучитьМассивУзловАтлант();
	
	Если МассивУзловАтлант.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДополнительныеСвойства.Свойство("НеРегистрироватьИзмененияДляСайта")
			 И Объект.ДополнительныеСвойства.НеРегистрироватьИзмененияДляСайта = Истина Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ТипОбъекта = ТипЗнч(Объект);

	МассивОбъектовДляРегистрации = Новый Массив;
	
	Если ТипОбъекта = Тип("СправочникОбъект.Номенклатура") Тогда
		
		МассивОбъектовДляРегистрации.Добавить(Объект.Ссылка);

	КонецЕсли;
	
	//Регистрация объектов на узлах
	Если МассивОбъектовДляРегистрации.Количество() > 0 Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловАтлант, МассивОбъектовДляРегистрации);

	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивУзловАтлант()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.смартОбменСоСкладомАтлант
	|ГДЕ
	|	НЕ ЭтотУзел
	|	И НЕ ПометкаУдаления";
	
	ТаблицаУзлов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаУзлов.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти
